<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006-2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 流年 <liu21st@gmail.com>
// +----------------------------------------------------------------------

// 应用公共文件

function is_md5($val){
    if(preg_match("/^[a-z|A-Z0-9]{16}$/", $val) || preg_match("/^[a-z|A-Z0-9]{32}$/", $val)){
        return true;
    }else{
        return false;
    }
}